Masmiseim36/nxpSDK/boards/evkmimxrt1064_agm01/eiq_examples/tensorflow_lite_micro_adt/pin_mux.h
/*
 * Copyright 2021 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/*! @brief Direction type  */
typedef enum _pin_mux_direction
{
  kPIN_MUX_DirectionInput = 0U,         /* Input direction */
  kPIN_MUX_DirectionOutput = 1U,        /* Output direction */
  kPIN_MUX_DirectionInputOrOutput = 2U  /* Input or output direction */
} pin_mux_direction_t;

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/* GPIO_AD_B0_13 (coord L14), UART1_RXD */
/* Routed pin properties */
#define BOARD_INITPINS_UART1_RXD_PERIPHERAL                              LPUART1   /*!< Peripheral name */
#define BOARD_INITPINS_UART1_RXD_SIGNAL                                       RX   /*!< Signal name */

/* GPIO_AD_B0_12 (coord K14), UART1_TXD */
/* Routed pin properties */
#define BOARD_INITPINS_UART1_TXD_PERIPHERAL                              LPUART1   /*!< Peripheral name */
#define BOARD_INITPINS_UART1_TXD_SIGNAL                                       TX   /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void LPI2C1_InitPins(void);

#define LPI2C1_DEINITPINS_IOMUXC_GPR_GPR26_GPIO_MUX1_GPIO_SEL_MASK 0x030000U /*!< GPIO1 and GPIO6 share same IO MUX function, GPIO_MUX1 selects one GPIO function: affected bits mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void LPI2C1_DeinitPins(void);

/* GPIO_SD_B0_01 (coord J3), SD1_CLK/J24[3] */
/* Routed pin properties */
#define LPSPI1_INITPINS_SD1_CLK_PERIPHERAL                                LPSPI1   /*!< Peripheral name */
#define LPSPI1_INITPINS_SD1_CLK_SIGNAL                                      PCS0   /*!< Signal name */

/* GPIO_SD_B0_00 (coord J4), SD1_CMD/J24[6] */
/* Routed pin properties */
#define LPSPI1_INITPINS_SD1_CMD_PERIPHERAL                                LPSPI1   /*!< Peripheral name */
#define LPSPI1_INITPINS_SD1_CMD_SIGNAL                                       SCK   /*!< Signal name */

/* GPIO_SD_B0_03 (coord K1), SD1_D1/J24[5]/SPI_MISO */
/* Routed pin properties */
#define LPSPI1_INITPINS_SD1_D1_PERIPHERAL                                 LPSPI1   /*!< Peripheral name */
#define LPSPI1_INITPINS_SD1_D1_SIGNAL                                        SDI   /*!< Signal name */

/* GPIO_SD_B0_02 (coord J1), SD1_D0/J24[4]/SPI_MOSI/PWM */
/* Routed pin properties */
#define LPSPI1_INITPINS_SD1_D0_PERIPHERAL                                 LPSPI1   /*!< Peripheral name */
#define LPSPI1_INITPINS_SD1_D0_SIGNAL                                        SDO   /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void LPSPI1_InitPins(void);

#define LPSPI1_DEINITPINS_IOMUXC_GPR_GPR28_GPIO_MUX3_GPIO_SEL_MASK 0xF000U /*!< GPIO3 and GPIO8 share same IO MUX function, GPIO_MUX3 selects one GPIO function: affected bits mask */

/* GPIO_SD_B0_00 (coord J4), SD1_CMD/J24[6] */
/* Routed pin properties */
#define LPSPI1_DEINITPINS_SD1_CMD_PERIPHERAL                               GPIO3   /*!< Peripheral name */
#define LPSPI1_DEINITPINS_SD1_CMD_SIGNAL                                 gpio_io   /*!< Signal name */
#define LPSPI1_DEINITPINS_SD1_CMD_CHANNEL                                    12U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define LPSPI1_DEINITPINS_SD1_CMD_GPIO                                     GPIO3   /*!< GPIO peripheral base pointer */
#define LPSPI1_DEINITPINS_SD1_CMD_GPIO_PIN                                   12U   /*!< GPIO pin number */
#define LPSPI1_DEINITPINS_SD1_CMD_GPIO_PIN_MASK                      (1U << 12U)   /*!< GPIO pin mask */
#define LPSPI1_DEINITPINS_SD1_CMD_PORT                                     GPIO3   /*!< PORT peripheral base pointer */
#define LPSPI1_DEINITPINS_SD1_CMD_PIN                                        12U   /*!< PORT pin number */
#define LPSPI1_DEINITPINS_SD1_CMD_PIN_MASK                           (1U << 12U)   /*!< PORT pin mask */

/* GPIO_SD_B0_01 (coord J3), SD1_CLK/J24[3] */
/* Routed pin properties */
#define LPSPI1_DEINITPINS_SD1_CLK_PERIPHERAL                               GPIO3   /*!< Peripheral name */
#define LPSPI1_DEINITPINS_SD1_CLK_SIGNAL                                 gpio_io   /*!< Signal name */
#define LPSPI1_DEINITPINS_SD1_CLK_CHANNEL                                    13U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define LPSPI1_DEINITPINS_SD1_CLK_GPIO                                     GPIO3   /*!< GPIO peripheral base pointer */
#define LPSPI1_DEINITPINS_SD1_CLK_GPIO_PIN                                   13U   /*!< GPIO pin number */
#define LPSPI1_DEINITPINS_SD1_CLK_GPIO_PIN_MASK                      (1U << 13U)   /*!< GPIO pin mask */
#define LPSPI1_DEINITPINS_SD1_CLK_PORT                                     GPIO3   /*!< PORT peripheral base pointer */
#define LPSPI1_DEINITPINS_SD1_CLK_PIN                                        13U   /*!< PORT pin number */
#define LPSPI1_DEINITPINS_SD1_CLK_PIN_MASK                           (1U << 13U)   /*!< PORT pin mask */

