Masmiseim36/nxpSDK/boards/evkmimxrt1064_agm01/eiq_examples/tensorflow_lite_micro_adt/pin_mux.h
/* GPIO_SD_B0_02 (coord J1), SD1_D0/J24[4]/SPI_MOSI/PWM */
/* Routed pin properties */
#define LPSPI1_DEINITPINS_SD1_D0_PERIPHERAL                                GPIO3   /*!< Peripheral name */
#define LPSPI1_DEINITPINS_SD1_D0_SIGNAL                                  gpio_io   /*!< Signal name */
#define LPSPI1_DEINITPINS_SD1_D0_CHANNEL                                     14U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define LPSPI1_DEINITPINS_SD1_D0_GPIO                                      GPIO3   /*!< GPIO peripheral base pointer */
#define LPSPI1_DEINITPINS_SD1_D0_GPIO_PIN                                    14U   /*!< GPIO pin number */
#define LPSPI1_DEINITPINS_SD1_D0_GPIO_PIN_MASK                       (1U << 14U)   /*!< GPIO pin mask */
#define LPSPI1_DEINITPINS_SD1_D0_PORT                                      GPIO3   /*!< PORT peripheral base pointer */
#define LPSPI1_DEINITPINS_SD1_D0_PIN                                         14U   /*!< PORT pin number */
#define LPSPI1_DEINITPINS_SD1_D0_PIN_MASK                            (1U << 14U)   /*!< PORT pin mask */

/* GPIO_SD_B0_03 (coord K1), SD1_D1/J24[5]/SPI_MISO */
/* Routed pin properties */
#define LPSPI1_DEINITPINS_SD1_D1_PERIPHERAL                                GPIO3   /*!< Peripheral name */
#define LPSPI1_DEINITPINS_SD1_D1_SIGNAL                                  gpio_io   /*!< Signal name */
#define LPSPI1_DEINITPINS_SD1_D1_CHANNEL                                     15U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define LPSPI1_DEINITPINS_SD1_D1_GPIO                                      GPIO3   /*!< GPIO peripheral base pointer */
#define LPSPI1_DEINITPINS_SD1_D1_GPIO_PIN                                    15U   /*!< GPIO pin number */
#define LPSPI1_DEINITPINS_SD1_D1_GPIO_PIN_MASK                       (1U << 15U)   /*!< GPIO pin mask */
#define LPSPI1_DEINITPINS_SD1_D1_PORT                                      GPIO3   /*!< PORT peripheral base pointer */
#define LPSPI1_DEINITPINS_SD1_D1_PIN                                         15U   /*!< PORT pin number */
#define LPSPI1_DEINITPINS_SD1_D1_PIN_MASK                            (1U << 15U)   /*!< PORT pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void LPSPI1_DeinitPins(void);

/* GPIO_AD_B0_12 (coord K14), UART1_TXD */
/* Routed pin properties */
#define LPUART1_INITPINS_UART1_TXD_PERIPHERAL                            LPUART1   /*!< Peripheral name */
#define LPUART1_INITPINS_UART1_TXD_SIGNAL                                     TX   /*!< Signal name */

/* GPIO_AD_B0_13 (coord L14), UART1_RXD */
/* Routed pin properties */
#define LPUART1_INITPINS_UART1_RXD_PERIPHERAL                            LPUART1   /*!< Peripheral name */
#define LPUART1_INITPINS_UART1_RXD_SIGNAL                                     RX   /*!< Signal name */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void LPUART1_InitPins(void);

#define LPUART1_DEINITPINS_IOMUXC_GPR_GPR26_GPIO_MUX1_GPIO_SEL_MASK 0x3000U /*!< GPIO1 and GPIO6 share same IO MUX function, GPIO_MUX1 selects one GPIO function: affected bits mask */

/* GPIO_AD_B0_12 (coord K14), UART1_TXD */
/* Routed pin properties */
#define LPUART1_DEINITPINS_UART1_TXD_PERIPHERAL                            GPIO1   /*!< Peripheral name */
#define LPUART1_DEINITPINS_UART1_TXD_SIGNAL                              gpio_io   /*!< Signal name */
#define LPUART1_DEINITPINS_UART1_TXD_CHANNEL                                 12U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define LPUART1_DEINITPINS_UART1_TXD_GPIO                                  GPIO1   /*!< GPIO peripheral base pointer */
#define LPUART1_DEINITPINS_UART1_TXD_GPIO_PIN                                12U   /*!< GPIO pin number */
#define LPUART1_DEINITPINS_UART1_TXD_GPIO_PIN_MASK                   (1U << 12U)   /*!< GPIO pin mask */
#define LPUART1_DEINITPINS_UART1_TXD_PORT                                  GPIO1   /*!< PORT peripheral base pointer */
#define LPUART1_DEINITPINS_UART1_TXD_PIN                                     12U   /*!< PORT pin number */
#define LPUART1_DEINITPINS_UART1_TXD_PIN_MASK                        (1U << 12U)   /*!< PORT pin mask */

/* GPIO_AD_B0_13 (coord L14), UART1_RXD */
/* Routed pin properties */
#define LPUART1_DEINITPINS_UART1_RXD_PERIPHERAL                            GPIO1   /*!< Peripheral name */
#define LPUART1_DEINITPINS_UART1_RXD_SIGNAL                              gpio_io   /*!< Signal name */
#define LPUART1_DEINITPINS_UART1_RXD_CHANNEL                                 13U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define LPUART1_DEINITPINS_UART1_RXD_GPIO                                  GPIO1   /*!< GPIO peripheral base pointer */
#define LPUART1_DEINITPINS_UART1_RXD_GPIO_PIN                                13U   /*!< GPIO pin number */
#define LPUART1_DEINITPINS_UART1_RXD_GPIO_PIN_MASK                   (1U << 13U)   /*!< GPIO pin mask */
#define LPUART1_DEINITPINS_UART1_RXD_PORT                                  GPIO1   /*!< PORT peripheral base pointer */
#define LPUART1_DEINITPINS_UART1_RXD_PIN                                     13U   /*!< PORT pin number */
#define LPUART1_DEINITPINS_UART1_RXD_PIN_MASK                        (1U << 13U)   /*!< PORT pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void LPUART1_DeinitPins(void);

/* GPIO_EMC_09 (coord C2), SEMC_A0 */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_A0_PERIPHERAL                              SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_A0_SIGNAL                                  ADDR   /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_A0_CHANNEL                                   0U   /*!< Signal channel */

/* GPIO_EMC_10 (coord G1), SEMC_A1 */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_A1_PERIPHERAL                              SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_A1_SIGNAL                                  ADDR   /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_A1_CHANNEL                                   1U   /*!< Signal channel */

/* GPIO_EMC_11 (coord G3), SEMC_A2 */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_A2_PERIPHERAL                              SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_A2_SIGNAL                                  ADDR   /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_A2_CHANNEL                                   2U   /*!< Signal channel */

/* GPIO_EMC_12 (coord H1), SEMC_A3 */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_A3_PERIPHERAL                              SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_A3_SIGNAL                                  ADDR   /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_A3_CHANNEL                                   3U   /*!< Signal channel */

/* GPIO_EMC_13 (coord A6), SEMC_A4 */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_A4_PERIPHERAL                              SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_A4_SIGNAL                                  ADDR   /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_A4_CHANNEL                                   4U   /*!< Signal channel */

/* GPIO_EMC_14 (coord B6), SEMC_A5 */
/* Routed pin properties */
#define BOARD_INITSDRAMPINS_SEMC_A5_PERIPHERAL                              SEMC   /*!< Peripheral name */
#define BOARD_INITSDRAMPINS_SEMC_A5_SIGNAL                                  ADDR   /*!< Signal name */
#define BOARD_INITSDRAMPINS_SEMC_A5_CHANNEL                                   5U   /*!< Signal channel */

